Repository: jopaul0/blog-generator-wp-plugin
Catalog: languages/blog-generator-*.po
Languages: es_es, fr_fr, pt_br

source: Blog Generator
es_es: Generador de Blog
fr_fr: Générateur de Blog
pt_br: Gerador de Blog

source: Generate New Post
es_es: Generar Nueva Entrada
fr_fr: Générer un nouvel article
pt_br: Gerar Novo Post

source: Generator
es_es: Generador
fr_fr: Générateur
pt_br: Gerador

source: Blog Generator Settings
es_es: Ajustes del Generador
fr_fr: Réglages du Générateur
pt_br: Configurações do Gerador

source: Settings
es_es: Ajustes
fr_fr: Réglages
pt_br: Configurações

source: Generate New Blog Post
es_es: Generar Nueva Entrada de Blog
fr_fr: Générer un nouvel article de blog
pt_br: Gerar Novo Post de Blog

source: Detailed Theme
es_es: Tema Detallado
fr_fr: Thème détaillé
pt_br: Tema Detalhado

source: Describe the topic for the AI...
es_es: Describe el tema para la IA...
fr_fr: Décrivez le sujet pour l'IA...
pt_br: Descreva o tópico para a IA...

source: Min Words
es_es: Mínimo de Palabras
fr_fr: Nombre de mots minimum
pt_br: Mínimo de Palavras

source: Max Words
es_es: Máximo de Palabras
fr_fr: Nombre de mots maximum
pt_br: Máximo de Palavras

source: Generate Article
es_es: Generar Artículo
fr_fr: Générer l'article
pt_br: Gerar Artigo

source: Processing with AI... Please wait.
es_es: Procesando con IA... Por favor, espere.
fr_fr: Traitement par l'IA... Veuillez patienter.
pt_br: Processando com IA... Por favor, aguarde.

source: Success!
es_es: ¡Éxito!
fr_fr: Succès !
pt_br: Sucesso!

source: Draft created.
es_es: Borrador creado.
fr_fr: Brouillon créé.
pt_br: Rascunho criado.

source: Click here to edit the post.
es_es: Haga clic aquí para editar la entrada.
fr_fr: Cliquez ici pour modifier l'article.
pt_br: Clique aqui para editar o post.

source: Gemini API Token
es_es: Token de la API de Gemini
fr_fr: Jeton API Gemini
pt_br: Token da API Gemini

source: AI Persona
es_es: Persona de la IA
fr_fr: Persona de l'IA
pt_br: Persona da IA

source: Define how the AI should behave.
es_es: Define cómo debe comportarse la IA.
fr_fr: Définissez comment l'IA doit se comporter.
pt_br: Defina como a IA deve se comportar.

source: Tone of Voice
es_es: Tono de Voz
fr_fr: Ton de voix
pt_br: Tom de Voz

source: Generation Language
es_es: Idioma de Generación
fr_fr: Langue de génération
pt_br: Idioma de Geração

source: The AI will generate the final content in this language.
es_es: La IA generará el contenido final en este idioma.
fr_fr: L'IA générera le contenu final dans cette langue.
pt_br: A IA gerará o conteúdo final neste idioma.

source: SEO Detection
es_es: Detección de SEO
fr_fr: Détection SEO
pt_br: Detecção de SEO

source: ✔ Yoast SEO detected and active.
es_es: ✔ Yoast SEO detectado y activo.
fr_fr: ✔ Yoast SEO détecté et actif.
pt_br: ✔ Yoast SEO detectado e ativo.

source: ✔ RankMath detected and active.
es_es: ✔ RankMath detectado y activo.
fr_fr: ✔ RankMath détecté et actif.
pt_br: ✔ RankMath detectado e ativo.

source: ✔ All in One SEO detected and active.
es_es: ✔ All in One SEO detectado y activo.
fr_fr: ✔ All in One SEO détecté et actif.
pt_br: ✔ All in One SEO detectado e ativo.

source: ⚠ No supported SEO plugin detected. Using WP default.
es_es: ⚠ No se ha detectado ningún plugin de SEO compatible. Usando el valor por defecto de WP.
fr_fr: ⚠ Aucun plugin SEO supporté n'a été détecté. Utilisation du défaut WP.
pt_br: ⚠ Nenhum plugin de SEO suportado detectado. Usando padrão do WP.
